/*******************************************************************************
* タイトル:		背景プログラム
* プログラム名:	background.cpp
* 作成者:			林劭羲
* 作成日:			2022/06/22
*******************************************************************************/

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "background.h"

/*******************************************************************************
* グローバル変数
*******************************************************************************/
FullwidthUnit bg_bounder;
FullwidthUnit bg_bounder_2;
FullwidthUnit bg_spike;

Textline bg_playerText;
Textline bg_scoreText;

/*******************************************************************************
 関数名:		InitBackground
 引数:		なし
 戻り値:		なし
 説明:		背景初期化
*******************************************************************************/
void InitBackground()
{
	bg_bounder		= { 0,1,1,25,"※",true };
	bg_bounder_2	= { 58,1,1,25,"※",true };
	bg_spike		= { 0,1,29,1,"▽",true };

	bg_playerText	= { 64,4,"プレイヤーHP",true };
	bg_scoreText	= { 67,10,"スコア",true };
	
}

/*******************************************************************************
 関数名:		UpdateBackground
 引数:		なし
 戻り値:		なし
 説明:		背景更新
*******************************************************************************/
void UpdateBackground()
{
	
}

/*******************************************************************************
 関数名:		DrawBackground
 引数:		なし
 戻り値:		なし
 説明:		背景描画
*******************************************************************************/
void DrawBackground()
{
	SetFullwidthUnit(GetWindow(), bg_spike);
	SetFullwidthUnit(GetWindow(), bg_bounder);
	SetFullwidthUnit(GetWindow(), bg_bounder_2);

	SetTextline(GetWindow(), bg_playerText);
	SetTextline(GetWindow(), bg_scoreText);
}

/*******************************************************************************
 関数名:		UninitBackground
 引数:		なし
 戻り値:		なし
 説明:		終了処理
*******************************************************************************/
void UninitBackground()
{
}
