/*******************************************************************************
* タイトル:		当たり判定プログラム
* プログラム名:	collision.cpp
* 作成者:			林劭羲
* 作成日:			2022/07/02
*******************************************************************************/

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "collision.h"

/*******************************************************************************
 関数名:		CheckCollision
 引数:		int x1, int y1, int w1, int h1, int x2, int y2, int w2, int h2
 戻り値:		true : 当たり判定あり / false : 当たり判定なし
 説明:		当たり判定を行う
*******************************************************************************/
bool CheckCollision(int x1, int y1, int w1, int h1, int x2, int y2, int w2, int h2)
{
	int x1_left = x1;					// 物体1左端座標
	int x1_right = x1 + w1 * 2 - 1;		// 物体1右端座標
	int x1_top = y1;					// 物体1上端座標
	int x1_bottom = y1 + h1 - 1;		// 物体1下端座標
	int x2_left = x2;					// 物体2左端座標
	int x2_right = x2 + w2 * 2 - 1;		// 物体2右端座標
	int x2_top = y2;					// 物体2上端座標
	int x2_bottom = y2 + h2 - 1;		// 物体2下端座標
	
	if (x1_right < x2_left || x1_left > x2_right || abs(y2 - y1) > 1)
	{
		return false;
	}
	else
	{
		return true;
	}
}
