/*******************************************************************************
* タイトル:		スコアプログラム
* プログラム名:	score.h
* 作成者:			林劭羲
* 作成日:			2022/07/05
*******************************************************************************/
#pragma once

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "draw.h"

/*******************************************************************************
* 構造体定義
*******************************************************************************/
struct SCORE
{
	int value;
	FullwidthUnit singleDigit;
	FullwidthUnit tenDigit;
	FullwidthUnit hundredDigit;
	FullwidthUnit kiloDigit;
	FullwidthUnit tenK_Digit;
	FullwidthUnit hundredK_Digit;
};

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitScore();
void UpdateScore();
void DrawScore();
void UninitScore();

void AddScore(int value);
SCORE* GetScore();
const char* Convert(int value);