/*******************************************************************************
* タイトル:		タイトルプログラム
* プログラム名:	title.cpp
* 作成者:			林劭羲
* 作成日:			2022/06/19
*******************************************************************************/

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "title.h"

/*******************************************************************************
* グローバル変数
*******************************************************************************/
Textline titleText;		//ゲームタイトル
Textline secText;		//第二タイトル

/*******************************************************************************
 関数名:		InitTitle
 引数:		なし
 戻り値:		なし
 説明:		初期化
*******************************************************************************/
void InitTitle()
{
	titleText	= {  33, 0, "階段を下りろ！", true };
	secText		= {  29, 20, "Press Enter to start", true };
}

/*******************************************************************************
 関数名:		UpdateTitle
 引数:		なし
 戻り値:		なし
 説明:		更新
*******************************************************************************/
void UpdateTitle()
{
	//タイトル落下処理
	titleText.pos_y += 1;

	if (titleText.pos_y >= 15)
	{
		titleText.pos_y = 15;
	}
	
	if (_kbhit() == 0)					// Key入力がない？
	{									// Key入力がないからここでリターンする
		return;
	}

	
	int key = _getch();					// キー入力処理
	if (key == 13)
	{
		SetState(GAME_TUTORIAL);		// Enterキーが押されたらチュートリアルに進む
	}
}

/*******************************************************************************
 関数名:		DrawTitle
 引数:		なし
 戻り値:		なし
 説明:		描画
*******************************************************************************/
void DrawTitle()
{
	SetTextline(GetWindow(), titleText);
	SetTextline(GetWindow(), secText);
	
	DrawWindow(GetWindow());
}

/*******************************************************************************
 関数名:		InitTitle
 引数:		なし
 戻り値:		なし
 説明:		終了処理
*******************************************************************************/
void UninitTitle()
{
	ClearWindow(GetWindow());
}
